----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 320, 320]           1,216
       BatchNorm2d-2         [-1, 64, 320, 320]             128
             PReLU-3         [-1, 64, 320, 320]               1
            Conv2d-4         [-1, 64, 320, 320]          36,928
       BatchNorm2d-5         [-1, 64, 320, 320]             128
             PReLU-6         [-1, 64, 320, 320]               1
             _Conv-7         [-1, 64, 320, 320]               0
         MaxPool2d-8         [-1, 64, 160, 160]               0
            Conv2d-9        [-1, 128, 160, 160]           8,320
           Conv2d-10        [-1, 128, 160, 160]         147,584
      BatchNorm2d-11        [-1, 128, 160, 160]             256
            PReLU-12        [-1, 128, 160, 160]               1
           Conv2d-13        [-1, 128, 160, 160]         147,584
      BatchNorm2d-14        [-1, 128, 160, 160]             256
            PReLU-15        [-1, 128, 160, 160]               1
            _Conv-16        [-1, 128, 160, 160]               0
            _Down-17        [-1, 128, 160, 160]               0
        MaxPool2d-18          [-1, 128, 80, 80]               0
           Conv2d-19          [-1, 256, 80, 80]          33,024
           Conv2d-20          [-1, 256, 80, 80]         590,080
      BatchNorm2d-21          [-1, 256, 80, 80]             512
            PReLU-22          [-1, 256, 80, 80]               1
           Conv2d-23          [-1, 256, 80, 80]         590,080
      BatchNorm2d-24          [-1, 256, 80, 80]             512
            PReLU-25          [-1, 256, 80, 80]               1
           Conv2d-26          [-1, 256, 80, 80]         590,080
      BatchNorm2d-27          [-1, 256, 80, 80]             512
            PReLU-28          [-1, 256, 80, 80]               1
            _Conv-29          [-1, 256, 80, 80]               0
            _Down-30          [-1, 256, 80, 80]               0
        MaxPool2d-31          [-1, 256, 40, 40]               0
           Conv2d-32          [-1, 512, 40, 40]         131,584
           Conv2d-33          [-1, 512, 40, 40]       2,359,808
      BatchNorm2d-34          [-1, 512, 40, 40]           1,024
            PReLU-35          [-1, 512, 40, 40]               1
           Conv2d-36          [-1, 512, 40, 40]       2,359,808
      BatchNorm2d-37          [-1, 512, 40, 40]           1,024
            PReLU-38          [-1, 512, 40, 40]               1
           Conv2d-39          [-1, 512, 40, 40]       2,359,808
      BatchNorm2d-40          [-1, 512, 40, 40]           1,024
            PReLU-41          [-1, 512, 40, 40]               1
            _Conv-42          [-1, 512, 40, 40]               0
            _Down-43          [-1, 512, 40, 40]               0
        MaxPool2d-44          [-1, 512, 20, 20]               0
           Conv2d-45         [-1, 1024, 20, 20]         525,312
           Conv2d-46         [-1, 1024, 20, 20]       9,438,208
      BatchNorm2d-47         [-1, 1024, 20, 20]           2,048
            PReLU-48         [-1, 1024, 20, 20]               1
           Conv2d-49         [-1, 1024, 20, 20]       9,438,208
      BatchNorm2d-50         [-1, 1024, 20, 20]           2,048
            PReLU-51         [-1, 1024, 20, 20]               1
           Conv2d-52         [-1, 1024, 20, 20]       9,438,208
      BatchNorm2d-53         [-1, 1024, 20, 20]           2,048
            PReLU-54         [-1, 1024, 20, 20]               1
            _Conv-55         [-1, 1024, 20, 20]               0
            _Down-56         [-1, 1024, 20, 20]               0
  ConvTranspose2d-57          [-1, 512, 40, 40]       2,097,664
           Conv2d-58          [-1, 512, 40, 40]       2,359,808
      BatchNorm2d-59          [-1, 512, 40, 40]           1,024
            PReLU-60          [-1, 512, 40, 40]               1
            _Conv-61          [-1, 512, 40, 40]               0
          _UpConv-62          [-1, 512, 40, 40]               0
           Conv2d-63          [-1, 512, 40, 40]         524,800
           Conv2d-64          [-1, 512, 40, 40]       2,359,808
      BatchNorm2d-65          [-1, 512, 40, 40]           1,024
            PReLU-66          [-1, 512, 40, 40]               1
           Conv2d-67          [-1, 512, 40, 40]       2,359,808
      BatchNorm2d-68          [-1, 512, 40, 40]           1,024
            PReLU-69          [-1, 512, 40, 40]               1
           Conv2d-70          [-1, 512, 40, 40]       2,359,808
      BatchNorm2d-71          [-1, 512, 40, 40]           1,024
            PReLU-72          [-1, 512, 40, 40]               1
            _Conv-73          [-1, 512, 40, 40]               0
              _Up-74          [-1, 512, 40, 40]               0
  ConvTranspose2d-75          [-1, 256, 80, 80]         524,544
           Conv2d-76          [-1, 256, 80, 80]         590,080
      BatchNorm2d-77          [-1, 256, 80, 80]             512
            PReLU-78          [-1, 256, 80, 80]               1
            _Conv-79          [-1, 256, 80, 80]               0
          _UpConv-80          [-1, 256, 80, 80]               0
           Conv2d-81          [-1, 256, 80, 80]         131,328
           Conv2d-82          [-1, 256, 80, 80]         590,080
      BatchNorm2d-83          [-1, 256, 80, 80]             512
            PReLU-84          [-1, 256, 80, 80]               1
           Conv2d-85          [-1, 256, 80, 80]         590,080
      BatchNorm2d-86          [-1, 256, 80, 80]             512
            PReLU-87          [-1, 256, 80, 80]               1
           Conv2d-88          [-1, 256, 80, 80]         590,080
      BatchNorm2d-89          [-1, 256, 80, 80]             512
            PReLU-90          [-1, 256, 80, 80]               1
            _Conv-91          [-1, 256, 80, 80]               0
              _Up-92          [-1, 256, 80, 80]               0
  ConvTranspose2d-93        [-1, 128, 160, 160]         131,200
           Conv2d-94        [-1, 128, 160, 160]         147,584
      BatchNorm2d-95        [-1, 128, 160, 160]             256
            PReLU-96        [-1, 128, 160, 160]               1
            _Conv-97        [-1, 128, 160, 160]               0
          _UpConv-98        [-1, 128, 160, 160]               0
           Conv2d-99        [-1, 128, 160, 160]          32,896
          Conv2d-100        [-1, 128, 160, 160]         147,584
     BatchNorm2d-101        [-1, 128, 160, 160]             256
           PReLU-102        [-1, 128, 160, 160]               1
          Conv2d-103        [-1, 128, 160, 160]         147,584
     BatchNorm2d-104        [-1, 128, 160, 160]             256
           PReLU-105        [-1, 128, 160, 160]               1
          Conv2d-106        [-1, 128, 160, 160]         147,584
     BatchNorm2d-107        [-1, 128, 160, 160]             256
           PReLU-108        [-1, 128, 160, 160]               1
           _Conv-109        [-1, 128, 160, 160]               0
             _Up-110        [-1, 128, 160, 160]               0
 ConvTranspose2d-111         [-1, 64, 320, 320]          32,832
          Conv2d-112         [-1, 64, 320, 320]          36,928
     BatchNorm2d-113         [-1, 64, 320, 320]             128
           PReLU-114         [-1, 64, 320, 320]               1
           _Conv-115         [-1, 64, 320, 320]               0
         _UpConv-116         [-1, 64, 320, 320]               0
          Conv2d-117         [-1, 64, 320, 320]           8,256
          Conv2d-118         [-1, 64, 320, 320]          36,928
     BatchNorm2d-119         [-1, 64, 320, 320]             128
           PReLU-120         [-1, 64, 320, 320]               1
          Conv2d-121         [-1, 64, 320, 320]          36,928
     BatchNorm2d-122         [-1, 64, 320, 320]             128
           PReLU-123         [-1, 64, 320, 320]               1
           _Conv-124         [-1, 64, 320, 320]               0
             _Up-125         [-1, 64, 320, 320]               0
          Conv2d-126          [-1, 3, 320, 320]           1,731
================================================================
Total params: 54,200,863
Trainable params: 54,200,863
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.78
Forward/backward pass size (MB): 2400.78
Params size (MB): 206.76
Estimated Total Size (MB): 2608.32
----------------------------------------------------------------
