----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 96, 256, 256]          14,112
       BatchNorm2d-2         [-1, 96, 256, 256]             192
              ReLU-3         [-1, 96, 256, 256]               0
         MaxPool2d-4         [-1, 96, 128, 128]               0
       BatchNorm2d-5         [-1, 96, 128, 128]             192
              ReLU-6         [-1, 96, 128, 128]               0
            Conv2d-7        [-1, 192, 128, 128]          18,432
       BatchNorm2d-8        [-1, 192, 128, 128]             384
              ReLU-9        [-1, 192, 128, 128]               0
           Conv2d-10         [-1, 48, 128, 128]          82,944
      _DenseLayer-11         [-1, 48, 128, 128]               0
      BatchNorm2d-12        [-1, 144, 128, 128]             288
             ReLU-13        [-1, 144, 128, 128]               0
           Conv2d-14        [-1, 192, 128, 128]          27,648
      BatchNorm2d-15        [-1, 192, 128, 128]             384
             ReLU-16        [-1, 192, 128, 128]               0
           Conv2d-17         [-1, 48, 128, 128]          82,944
      _DenseLayer-18         [-1, 48, 128, 128]               0
      BatchNorm2d-19        [-1, 192, 128, 128]             384
             ReLU-20        [-1, 192, 128, 128]               0
           Conv2d-21        [-1, 192, 128, 128]          36,864
      BatchNorm2d-22        [-1, 192, 128, 128]             384
             ReLU-23        [-1, 192, 128, 128]               0
           Conv2d-24         [-1, 48, 128, 128]          82,944
      _DenseLayer-25         [-1, 48, 128, 128]               0
      BatchNorm2d-26        [-1, 240, 128, 128]             480
             ReLU-27        [-1, 240, 128, 128]               0
           Conv2d-28        [-1, 192, 128, 128]          46,080
      BatchNorm2d-29        [-1, 192, 128, 128]             384
             ReLU-30        [-1, 192, 128, 128]               0
           Conv2d-31         [-1, 48, 128, 128]          82,944
      _DenseLayer-32         [-1, 48, 128, 128]               0
      BatchNorm2d-33        [-1, 288, 128, 128]             576
             ReLU-34        [-1, 288, 128, 128]               0
           Conv2d-35        [-1, 192, 128, 128]          55,296
      BatchNorm2d-36        [-1, 192, 128, 128]             384
             ReLU-37        [-1, 192, 128, 128]               0
           Conv2d-38         [-1, 48, 128, 128]          82,944
      _DenseLayer-39         [-1, 48, 128, 128]               0
      BatchNorm2d-40        [-1, 336, 128, 128]             672
             ReLU-41        [-1, 336, 128, 128]               0
           Conv2d-42        [-1, 192, 128, 128]          64,512
      BatchNorm2d-43        [-1, 192, 128, 128]             384
             ReLU-44        [-1, 192, 128, 128]               0
           Conv2d-45         [-1, 48, 128, 128]          82,944
      _DenseLayer-46         [-1, 48, 128, 128]               0
      _DenseBlock-47        [-1, 384, 128, 128]               0
      BatchNorm2d-48        [-1, 384, 128, 128]             768
             ReLU-49        [-1, 384, 128, 128]               0
           Conv2d-50        [-1, 192, 128, 128]          73,728
        AvgPool2d-51          [-1, 192, 64, 64]               0
      BatchNorm2d-52          [-1, 192, 64, 64]             384
             ReLU-53          [-1, 192, 64, 64]               0
           Conv2d-54          [-1, 192, 64, 64]          36,864
      BatchNorm2d-55          [-1, 192, 64, 64]             384
             ReLU-56          [-1, 192, 64, 64]               0
           Conv2d-57           [-1, 48, 64, 64]          82,944
      _DenseLayer-58           [-1, 48, 64, 64]               0
      BatchNorm2d-59          [-1, 240, 64, 64]             480
             ReLU-60          [-1, 240, 64, 64]               0
           Conv2d-61          [-1, 192, 64, 64]          46,080
      BatchNorm2d-62          [-1, 192, 64, 64]             384
             ReLU-63          [-1, 192, 64, 64]               0
           Conv2d-64           [-1, 48, 64, 64]          82,944
      _DenseLayer-65           [-1, 48, 64, 64]               0
      BatchNorm2d-66          [-1, 288, 64, 64]             576
             ReLU-67          [-1, 288, 64, 64]               0
           Conv2d-68          [-1, 192, 64, 64]          55,296
      BatchNorm2d-69          [-1, 192, 64, 64]             384
             ReLU-70          [-1, 192, 64, 64]               0
           Conv2d-71           [-1, 48, 64, 64]          82,944
      _DenseLayer-72           [-1, 48, 64, 64]               0
      BatchNorm2d-73          [-1, 336, 64, 64]             672
             ReLU-74          [-1, 336, 64, 64]               0
           Conv2d-75          [-1, 192, 64, 64]          64,512
      BatchNorm2d-76          [-1, 192, 64, 64]             384
             ReLU-77          [-1, 192, 64, 64]               0
           Conv2d-78           [-1, 48, 64, 64]          82,944
      _DenseLayer-79           [-1, 48, 64, 64]               0
      BatchNorm2d-80          [-1, 384, 64, 64]             768
             ReLU-81          [-1, 384, 64, 64]               0
           Conv2d-82          [-1, 192, 64, 64]          73,728
      BatchNorm2d-83          [-1, 192, 64, 64]             384
             ReLU-84          [-1, 192, 64, 64]               0
           Conv2d-85           [-1, 48, 64, 64]          82,944
      _DenseLayer-86           [-1, 48, 64, 64]               0
      BatchNorm2d-87          [-1, 432, 64, 64]             864
             ReLU-88          [-1, 432, 64, 64]               0
           Conv2d-89          [-1, 192, 64, 64]          82,944
      BatchNorm2d-90          [-1, 192, 64, 64]             384
             ReLU-91          [-1, 192, 64, 64]               0
           Conv2d-92           [-1, 48, 64, 64]          82,944
      _DenseLayer-93           [-1, 48, 64, 64]               0
      BatchNorm2d-94          [-1, 480, 64, 64]             960
             ReLU-95          [-1, 480, 64, 64]               0
           Conv2d-96          [-1, 192, 64, 64]          92,160
      BatchNorm2d-97          [-1, 192, 64, 64]             384
             ReLU-98          [-1, 192, 64, 64]               0
           Conv2d-99           [-1, 48, 64, 64]          82,944
     _DenseLayer-100           [-1, 48, 64, 64]               0
     BatchNorm2d-101          [-1, 528, 64, 64]           1,056
            ReLU-102          [-1, 528, 64, 64]               0
          Conv2d-103          [-1, 192, 64, 64]         101,376
     BatchNorm2d-104          [-1, 192, 64, 64]             384
            ReLU-105          [-1, 192, 64, 64]               0
          Conv2d-106           [-1, 48, 64, 64]          82,944
     _DenseLayer-107           [-1, 48, 64, 64]               0
     BatchNorm2d-108          [-1, 576, 64, 64]           1,152
            ReLU-109          [-1, 576, 64, 64]               0
          Conv2d-110          [-1, 192, 64, 64]         110,592
     BatchNorm2d-111          [-1, 192, 64, 64]             384
            ReLU-112          [-1, 192, 64, 64]               0
          Conv2d-113           [-1, 48, 64, 64]          82,944
     _DenseLayer-114           [-1, 48, 64, 64]               0
     BatchNorm2d-115          [-1, 624, 64, 64]           1,248
            ReLU-116          [-1, 624, 64, 64]               0
          Conv2d-117          [-1, 192, 64, 64]         119,808
     BatchNorm2d-118          [-1, 192, 64, 64]             384
            ReLU-119          [-1, 192, 64, 64]               0
          Conv2d-120           [-1, 48, 64, 64]          82,944
     _DenseLayer-121           [-1, 48, 64, 64]               0
     BatchNorm2d-122          [-1, 672, 64, 64]           1,344
            ReLU-123          [-1, 672, 64, 64]               0
          Conv2d-124          [-1, 192, 64, 64]         129,024
     BatchNorm2d-125          [-1, 192, 64, 64]             384
            ReLU-126          [-1, 192, 64, 64]               0
          Conv2d-127           [-1, 48, 64, 64]          82,944
     _DenseLayer-128           [-1, 48, 64, 64]               0
     BatchNorm2d-129          [-1, 720, 64, 64]           1,440
            ReLU-130          [-1, 720, 64, 64]               0
          Conv2d-131          [-1, 192, 64, 64]         138,240
     BatchNorm2d-132          [-1, 192, 64, 64]             384
            ReLU-133          [-1, 192, 64, 64]               0
          Conv2d-134           [-1, 48, 64, 64]          82,944
     _DenseLayer-135           [-1, 48, 64, 64]               0
     _DenseBlock-136          [-1, 768, 64, 64]               0
     BatchNorm2d-137          [-1, 768, 64, 64]           1,536
            ReLU-138          [-1, 768, 64, 64]               0
          Conv2d-139          [-1, 384, 64, 64]         294,912
       AvgPool2d-140          [-1, 384, 32, 32]               0
     BatchNorm2d-141          [-1, 384, 32, 32]             768
            ReLU-142          [-1, 384, 32, 32]               0
          Conv2d-143          [-1, 192, 32, 32]          73,728
     BatchNorm2d-144          [-1, 192, 32, 32]             384
            ReLU-145          [-1, 192, 32, 32]               0
          Conv2d-146           [-1, 48, 32, 32]          82,944
     _DenseLayer-147           [-1, 48, 32, 32]               0
     BatchNorm2d-148          [-1, 432, 32, 32]             864
            ReLU-149          [-1, 432, 32, 32]               0
          Conv2d-150          [-1, 192, 32, 32]          82,944
     BatchNorm2d-151          [-1, 192, 32, 32]             384
            ReLU-152          [-1, 192, 32, 32]               0
          Conv2d-153           [-1, 48, 32, 32]          82,944
     _DenseLayer-154           [-1, 48, 32, 32]               0
     BatchNorm2d-155          [-1, 480, 32, 32]             960
            ReLU-156          [-1, 480, 32, 32]               0
          Conv2d-157          [-1, 192, 32, 32]          92,160
     BatchNorm2d-158          [-1, 192, 32, 32]             384
            ReLU-159          [-1, 192, 32, 32]               0
          Conv2d-160           [-1, 48, 32, 32]          82,944
     _DenseLayer-161           [-1, 48, 32, 32]               0
     BatchNorm2d-162          [-1, 528, 32, 32]           1,056
            ReLU-163          [-1, 528, 32, 32]               0
          Conv2d-164          [-1, 192, 32, 32]         101,376
     BatchNorm2d-165          [-1, 192, 32, 32]             384
            ReLU-166          [-1, 192, 32, 32]               0
          Conv2d-167           [-1, 48, 32, 32]          82,944
     _DenseLayer-168           [-1, 48, 32, 32]               0
     BatchNorm2d-169          [-1, 576, 32, 32]           1,152
            ReLU-170          [-1, 576, 32, 32]               0
          Conv2d-171          [-1, 192, 32, 32]         110,592
     BatchNorm2d-172          [-1, 192, 32, 32]             384
            ReLU-173          [-1, 192, 32, 32]               0
          Conv2d-174           [-1, 48, 32, 32]          82,944
     _DenseLayer-175           [-1, 48, 32, 32]               0
     BatchNorm2d-176          [-1, 624, 32, 32]           1,248
            ReLU-177          [-1, 624, 32, 32]               0
          Conv2d-178          [-1, 192, 32, 32]         119,808
     BatchNorm2d-179          [-1, 192, 32, 32]             384
            ReLU-180          [-1, 192, 32, 32]               0
          Conv2d-181           [-1, 48, 32, 32]          82,944
     _DenseLayer-182           [-1, 48, 32, 32]               0
     BatchNorm2d-183          [-1, 672, 32, 32]           1,344
            ReLU-184          [-1, 672, 32, 32]               0
          Conv2d-185          [-1, 192, 32, 32]         129,024
     BatchNorm2d-186          [-1, 192, 32, 32]             384
            ReLU-187          [-1, 192, 32, 32]               0
          Conv2d-188           [-1, 48, 32, 32]          82,944
     _DenseLayer-189           [-1, 48, 32, 32]               0
     BatchNorm2d-190          [-1, 720, 32, 32]           1,440
            ReLU-191          [-1, 720, 32, 32]               0
          Conv2d-192          [-1, 192, 32, 32]         138,240
     BatchNorm2d-193          [-1, 192, 32, 32]             384
            ReLU-194          [-1, 192, 32, 32]               0
          Conv2d-195           [-1, 48, 32, 32]          82,944
     _DenseLayer-196           [-1, 48, 32, 32]               0
     BatchNorm2d-197          [-1, 768, 32, 32]           1,536
            ReLU-198          [-1, 768, 32, 32]               0
          Conv2d-199          [-1, 192, 32, 32]         147,456
     BatchNorm2d-200          [-1, 192, 32, 32]             384
            ReLU-201          [-1, 192, 32, 32]               0
          Conv2d-202           [-1, 48, 32, 32]          82,944
     _DenseLayer-203           [-1, 48, 32, 32]               0
     BatchNorm2d-204          [-1, 816, 32, 32]           1,632
            ReLU-205          [-1, 816, 32, 32]               0
          Conv2d-206          [-1, 192, 32, 32]         156,672
     BatchNorm2d-207          [-1, 192, 32, 32]             384
            ReLU-208          [-1, 192, 32, 32]               0
          Conv2d-209           [-1, 48, 32, 32]          82,944
     _DenseLayer-210           [-1, 48, 32, 32]               0
     BatchNorm2d-211          [-1, 864, 32, 32]           1,728
            ReLU-212          [-1, 864, 32, 32]               0
          Conv2d-213          [-1, 192, 32, 32]         165,888
     BatchNorm2d-214          [-1, 192, 32, 32]             384
            ReLU-215          [-1, 192, 32, 32]               0
          Conv2d-216           [-1, 48, 32, 32]          82,944
     _DenseLayer-217           [-1, 48, 32, 32]               0
     BatchNorm2d-218          [-1, 912, 32, 32]           1,824
            ReLU-219          [-1, 912, 32, 32]               0
          Conv2d-220          [-1, 192, 32, 32]         175,104
     BatchNorm2d-221          [-1, 192, 32, 32]             384
            ReLU-222          [-1, 192, 32, 32]               0
          Conv2d-223           [-1, 48, 32, 32]          82,944
     _DenseLayer-224           [-1, 48, 32, 32]               0
     BatchNorm2d-225          [-1, 960, 32, 32]           1,920
            ReLU-226          [-1, 960, 32, 32]               0
          Conv2d-227          [-1, 192, 32, 32]         184,320
     BatchNorm2d-228          [-1, 192, 32, 32]             384
            ReLU-229          [-1, 192, 32, 32]               0
          Conv2d-230           [-1, 48, 32, 32]          82,944
     _DenseLayer-231           [-1, 48, 32, 32]               0
     BatchNorm2d-232         [-1, 1008, 32, 32]           2,016
            ReLU-233         [-1, 1008, 32, 32]               0
          Conv2d-234          [-1, 192, 32, 32]         193,536
     BatchNorm2d-235          [-1, 192, 32, 32]             384
            ReLU-236          [-1, 192, 32, 32]               0
          Conv2d-237           [-1, 48, 32, 32]          82,944
     _DenseLayer-238           [-1, 48, 32, 32]               0
     BatchNorm2d-239         [-1, 1056, 32, 32]           2,112
            ReLU-240         [-1, 1056, 32, 32]               0
          Conv2d-241          [-1, 192, 32, 32]         202,752
     BatchNorm2d-242          [-1, 192, 32, 32]             384
            ReLU-243          [-1, 192, 32, 32]               0
          Conv2d-244           [-1, 48, 32, 32]          82,944
     _DenseLayer-245           [-1, 48, 32, 32]               0
     BatchNorm2d-246         [-1, 1104, 32, 32]           2,208
            ReLU-247         [-1, 1104, 32, 32]               0
          Conv2d-248          [-1, 192, 32, 32]         211,968
     BatchNorm2d-249          [-1, 192, 32, 32]             384
            ReLU-250          [-1, 192, 32, 32]               0
          Conv2d-251           [-1, 48, 32, 32]          82,944
     _DenseLayer-252           [-1, 48, 32, 32]               0
     BatchNorm2d-253         [-1, 1152, 32, 32]           2,304
            ReLU-254         [-1, 1152, 32, 32]               0
          Conv2d-255          [-1, 192, 32, 32]         221,184
     BatchNorm2d-256          [-1, 192, 32, 32]             384
            ReLU-257          [-1, 192, 32, 32]               0
          Conv2d-258           [-1, 48, 32, 32]          82,944
     _DenseLayer-259           [-1, 48, 32, 32]               0
     BatchNorm2d-260         [-1, 1200, 32, 32]           2,400
            ReLU-261         [-1, 1200, 32, 32]               0
          Conv2d-262          [-1, 192, 32, 32]         230,400
     BatchNorm2d-263          [-1, 192, 32, 32]             384
            ReLU-264          [-1, 192, 32, 32]               0
          Conv2d-265           [-1, 48, 32, 32]          82,944
     _DenseLayer-266           [-1, 48, 32, 32]               0
     BatchNorm2d-267         [-1, 1248, 32, 32]           2,496
            ReLU-268         [-1, 1248, 32, 32]               0
          Conv2d-269          [-1, 192, 32, 32]         239,616
     BatchNorm2d-270          [-1, 192, 32, 32]             384
            ReLU-271          [-1, 192, 32, 32]               0
          Conv2d-272           [-1, 48, 32, 32]          82,944
     _DenseLayer-273           [-1, 48, 32, 32]               0
     BatchNorm2d-274         [-1, 1296, 32, 32]           2,592
            ReLU-275         [-1, 1296, 32, 32]               0
          Conv2d-276          [-1, 192, 32, 32]         248,832
     BatchNorm2d-277          [-1, 192, 32, 32]             384
            ReLU-278          [-1, 192, 32, 32]               0
          Conv2d-279           [-1, 48, 32, 32]          82,944
     _DenseLayer-280           [-1, 48, 32, 32]               0
     BatchNorm2d-281         [-1, 1344, 32, 32]           2,688
            ReLU-282         [-1, 1344, 32, 32]               0
          Conv2d-283          [-1, 192, 32, 32]         258,048
     BatchNorm2d-284          [-1, 192, 32, 32]             384
            ReLU-285          [-1, 192, 32, 32]               0
          Conv2d-286           [-1, 48, 32, 32]          82,944
     _DenseLayer-287           [-1, 48, 32, 32]               0
     BatchNorm2d-288         [-1, 1392, 32, 32]           2,784
            ReLU-289         [-1, 1392, 32, 32]               0
          Conv2d-290          [-1, 192, 32, 32]         267,264
     BatchNorm2d-291          [-1, 192, 32, 32]             384
            ReLU-292          [-1, 192, 32, 32]               0
          Conv2d-293           [-1, 48, 32, 32]          82,944
     _DenseLayer-294           [-1, 48, 32, 32]               0
     BatchNorm2d-295         [-1, 1440, 32, 32]           2,880
            ReLU-296         [-1, 1440, 32, 32]               0
          Conv2d-297          [-1, 192, 32, 32]         276,480
     BatchNorm2d-298          [-1, 192, 32, 32]             384
            ReLU-299          [-1, 192, 32, 32]               0
          Conv2d-300           [-1, 48, 32, 32]          82,944
     _DenseLayer-301           [-1, 48, 32, 32]               0
     BatchNorm2d-302         [-1, 1488, 32, 32]           2,976
            ReLU-303         [-1, 1488, 32, 32]               0
          Conv2d-304          [-1, 192, 32, 32]         285,696
     BatchNorm2d-305          [-1, 192, 32, 32]             384
            ReLU-306          [-1, 192, 32, 32]               0
          Conv2d-307           [-1, 48, 32, 32]          82,944
     _DenseLayer-308           [-1, 48, 32, 32]               0
     BatchNorm2d-309         [-1, 1536, 32, 32]           3,072
            ReLU-310         [-1, 1536, 32, 32]               0
          Conv2d-311          [-1, 192, 32, 32]         294,912
     BatchNorm2d-312          [-1, 192, 32, 32]             384
            ReLU-313          [-1, 192, 32, 32]               0
          Conv2d-314           [-1, 48, 32, 32]          82,944
     _DenseLayer-315           [-1, 48, 32, 32]               0
     BatchNorm2d-316         [-1, 1584, 32, 32]           3,168
            ReLU-317         [-1, 1584, 32, 32]               0
          Conv2d-318          [-1, 192, 32, 32]         304,128
     BatchNorm2d-319          [-1, 192, 32, 32]             384
            ReLU-320          [-1, 192, 32, 32]               0
          Conv2d-321           [-1, 48, 32, 32]          82,944
     _DenseLayer-322           [-1, 48, 32, 32]               0
     BatchNorm2d-323         [-1, 1632, 32, 32]           3,264
            ReLU-324         [-1, 1632, 32, 32]               0
          Conv2d-325          [-1, 192, 32, 32]         313,344
     BatchNorm2d-326          [-1, 192, 32, 32]             384
            ReLU-327          [-1, 192, 32, 32]               0
          Conv2d-328           [-1, 48, 32, 32]          82,944
     _DenseLayer-329           [-1, 48, 32, 32]               0
     BatchNorm2d-330         [-1, 1680, 32, 32]           3,360
            ReLU-331         [-1, 1680, 32, 32]               0
          Conv2d-332          [-1, 192, 32, 32]         322,560
     BatchNorm2d-333          [-1, 192, 32, 32]             384
            ReLU-334          [-1, 192, 32, 32]               0
          Conv2d-335           [-1, 48, 32, 32]          82,944
     _DenseLayer-336           [-1, 48, 32, 32]               0
     BatchNorm2d-337         [-1, 1728, 32, 32]           3,456
            ReLU-338         [-1, 1728, 32, 32]               0
          Conv2d-339          [-1, 192, 32, 32]         331,776
     BatchNorm2d-340          [-1, 192, 32, 32]             384
            ReLU-341          [-1, 192, 32, 32]               0
          Conv2d-342           [-1, 48, 32, 32]          82,944
     _DenseLayer-343           [-1, 48, 32, 32]               0
     BatchNorm2d-344         [-1, 1776, 32, 32]           3,552
            ReLU-345         [-1, 1776, 32, 32]               0
          Conv2d-346          [-1, 192, 32, 32]         340,992
     BatchNorm2d-347          [-1, 192, 32, 32]             384
            ReLU-348          [-1, 192, 32, 32]               0
          Conv2d-349           [-1, 48, 32, 32]          82,944
     _DenseLayer-350           [-1, 48, 32, 32]               0
     BatchNorm2d-351         [-1, 1824, 32, 32]           3,648
            ReLU-352         [-1, 1824, 32, 32]               0
          Conv2d-353          [-1, 192, 32, 32]         350,208
     BatchNorm2d-354          [-1, 192, 32, 32]             384
            ReLU-355          [-1, 192, 32, 32]               0
          Conv2d-356           [-1, 48, 32, 32]          82,944
     _DenseLayer-357           [-1, 48, 32, 32]               0
     BatchNorm2d-358         [-1, 1872, 32, 32]           3,744
            ReLU-359         [-1, 1872, 32, 32]               0
          Conv2d-360          [-1, 192, 32, 32]         359,424
     BatchNorm2d-361          [-1, 192, 32, 32]             384
            ReLU-362          [-1, 192, 32, 32]               0
          Conv2d-363           [-1, 48, 32, 32]          82,944
     _DenseLayer-364           [-1, 48, 32, 32]               0
     BatchNorm2d-365         [-1, 1920, 32, 32]           3,840
            ReLU-366         [-1, 1920, 32, 32]               0
          Conv2d-367          [-1, 192, 32, 32]         368,640
     BatchNorm2d-368          [-1, 192, 32, 32]             384
            ReLU-369          [-1, 192, 32, 32]               0
          Conv2d-370           [-1, 48, 32, 32]          82,944
     _DenseLayer-371           [-1, 48, 32, 32]               0
     BatchNorm2d-372         [-1, 1968, 32, 32]           3,936
            ReLU-373         [-1, 1968, 32, 32]               0
          Conv2d-374          [-1, 192, 32, 32]         377,856
     BatchNorm2d-375          [-1, 192, 32, 32]             384
            ReLU-376          [-1, 192, 32, 32]               0
          Conv2d-377           [-1, 48, 32, 32]          82,944
     _DenseLayer-378           [-1, 48, 32, 32]               0
     BatchNorm2d-379         [-1, 2016, 32, 32]           4,032
            ReLU-380         [-1, 2016, 32, 32]               0
          Conv2d-381          [-1, 192, 32, 32]         387,072
     BatchNorm2d-382          [-1, 192, 32, 32]             384
            ReLU-383          [-1, 192, 32, 32]               0
          Conv2d-384           [-1, 48, 32, 32]          82,944
     _DenseLayer-385           [-1, 48, 32, 32]               0
     BatchNorm2d-386         [-1, 2064, 32, 32]           4,128
            ReLU-387         [-1, 2064, 32, 32]               0
          Conv2d-388          [-1, 192, 32, 32]         396,288
     BatchNorm2d-389          [-1, 192, 32, 32]             384
            ReLU-390          [-1, 192, 32, 32]               0
          Conv2d-391           [-1, 48, 32, 32]          82,944
     _DenseLayer-392           [-1, 48, 32, 32]               0
     _DenseBlock-393         [-1, 2112, 32, 32]               0
     BatchNorm2d-394         [-1, 2112, 32, 32]           4,224
            ReLU-395         [-1, 2112, 32, 32]               0
          Conv2d-396         [-1, 1056, 32, 32]       2,230,272
       AvgPool2d-397         [-1, 1056, 16, 16]               0
     BatchNorm2d-398         [-1, 1056, 16, 16]           2,112
            ReLU-399         [-1, 1056, 16, 16]               0
          Conv2d-400          [-1, 192, 16, 16]         202,752
     BatchNorm2d-401          [-1, 192, 16, 16]             384
            ReLU-402          [-1, 192, 16, 16]               0
          Conv2d-403           [-1, 48, 16, 16]          82,944
     _DenseLayer-404           [-1, 48, 16, 16]               0
     BatchNorm2d-405         [-1, 1104, 16, 16]           2,208
            ReLU-406         [-1, 1104, 16, 16]               0
          Conv2d-407          [-1, 192, 16, 16]         211,968
     BatchNorm2d-408          [-1, 192, 16, 16]             384
            ReLU-409          [-1, 192, 16, 16]               0
          Conv2d-410           [-1, 48, 16, 16]          82,944
     _DenseLayer-411           [-1, 48, 16, 16]               0
     BatchNorm2d-412         [-1, 1152, 16, 16]           2,304
            ReLU-413         [-1, 1152, 16, 16]               0
          Conv2d-414          [-1, 192, 16, 16]         221,184
     BatchNorm2d-415          [-1, 192, 16, 16]             384
            ReLU-416          [-1, 192, 16, 16]               0
          Conv2d-417           [-1, 48, 16, 16]          82,944
     _DenseLayer-418           [-1, 48, 16, 16]               0
     BatchNorm2d-419         [-1, 1200, 16, 16]           2,400
            ReLU-420         [-1, 1200, 16, 16]               0
          Conv2d-421          [-1, 192, 16, 16]         230,400
     BatchNorm2d-422          [-1, 192, 16, 16]             384
            ReLU-423          [-1, 192, 16, 16]               0
          Conv2d-424           [-1, 48, 16, 16]          82,944
     _DenseLayer-425           [-1, 48, 16, 16]               0
     BatchNorm2d-426         [-1, 1248, 16, 16]           2,496
            ReLU-427         [-1, 1248, 16, 16]               0
          Conv2d-428          [-1, 192, 16, 16]         239,616
     BatchNorm2d-429          [-1, 192, 16, 16]             384
            ReLU-430          [-1, 192, 16, 16]               0
          Conv2d-431           [-1, 48, 16, 16]          82,944
     _DenseLayer-432           [-1, 48, 16, 16]               0
     BatchNorm2d-433         [-1, 1296, 16, 16]           2,592
            ReLU-434         [-1, 1296, 16, 16]               0
          Conv2d-435          [-1, 192, 16, 16]         248,832
     BatchNorm2d-436          [-1, 192, 16, 16]             384
            ReLU-437          [-1, 192, 16, 16]               0
          Conv2d-438           [-1, 48, 16, 16]          82,944
     _DenseLayer-439           [-1, 48, 16, 16]               0
     BatchNorm2d-440         [-1, 1344, 16, 16]           2,688
            ReLU-441         [-1, 1344, 16, 16]               0
          Conv2d-442          [-1, 192, 16, 16]         258,048
     BatchNorm2d-443          [-1, 192, 16, 16]             384
            ReLU-444          [-1, 192, 16, 16]               0
          Conv2d-445           [-1, 48, 16, 16]          82,944
     _DenseLayer-446           [-1, 48, 16, 16]               0
     BatchNorm2d-447         [-1, 1392, 16, 16]           2,784
            ReLU-448         [-1, 1392, 16, 16]               0
          Conv2d-449          [-1, 192, 16, 16]         267,264
     BatchNorm2d-450          [-1, 192, 16, 16]             384
            ReLU-451          [-1, 192, 16, 16]               0
          Conv2d-452           [-1, 48, 16, 16]          82,944
     _DenseLayer-453           [-1, 48, 16, 16]               0
     BatchNorm2d-454         [-1, 1440, 16, 16]           2,880
            ReLU-455         [-1, 1440, 16, 16]               0
          Conv2d-456          [-1, 192, 16, 16]         276,480
     BatchNorm2d-457          [-1, 192, 16, 16]             384
            ReLU-458          [-1, 192, 16, 16]               0
          Conv2d-459           [-1, 48, 16, 16]          82,944
     _DenseLayer-460           [-1, 48, 16, 16]               0
     BatchNorm2d-461         [-1, 1488, 16, 16]           2,976
            ReLU-462         [-1, 1488, 16, 16]               0
          Conv2d-463          [-1, 192, 16, 16]         285,696
     BatchNorm2d-464          [-1, 192, 16, 16]             384
            ReLU-465          [-1, 192, 16, 16]               0
          Conv2d-466           [-1, 48, 16, 16]          82,944
     _DenseLayer-467           [-1, 48, 16, 16]               0
     BatchNorm2d-468         [-1, 1536, 16, 16]           3,072
            ReLU-469         [-1, 1536, 16, 16]               0
          Conv2d-470          [-1, 192, 16, 16]         294,912
     BatchNorm2d-471          [-1, 192, 16, 16]             384
            ReLU-472          [-1, 192, 16, 16]               0
          Conv2d-473           [-1, 48, 16, 16]          82,944
     _DenseLayer-474           [-1, 48, 16, 16]               0
     BatchNorm2d-475         [-1, 1584, 16, 16]           3,168
            ReLU-476         [-1, 1584, 16, 16]               0
          Conv2d-477          [-1, 192, 16, 16]         304,128
     BatchNorm2d-478          [-1, 192, 16, 16]             384
            ReLU-479          [-1, 192, 16, 16]               0
          Conv2d-480           [-1, 48, 16, 16]          82,944
     _DenseLayer-481           [-1, 48, 16, 16]               0
     BatchNorm2d-482         [-1, 1632, 16, 16]           3,264
            ReLU-483         [-1, 1632, 16, 16]               0
          Conv2d-484          [-1, 192, 16, 16]         313,344
     BatchNorm2d-485          [-1, 192, 16, 16]             384
            ReLU-486          [-1, 192, 16, 16]               0
          Conv2d-487           [-1, 48, 16, 16]          82,944
     _DenseLayer-488           [-1, 48, 16, 16]               0
     BatchNorm2d-489         [-1, 1680, 16, 16]           3,360
            ReLU-490         [-1, 1680, 16, 16]               0
          Conv2d-491          [-1, 192, 16, 16]         322,560
     BatchNorm2d-492          [-1, 192, 16, 16]             384
            ReLU-493          [-1, 192, 16, 16]               0
          Conv2d-494           [-1, 48, 16, 16]          82,944
     _DenseLayer-495           [-1, 48, 16, 16]               0
     BatchNorm2d-496         [-1, 1728, 16, 16]           3,456
            ReLU-497         [-1, 1728, 16, 16]               0
          Conv2d-498          [-1, 192, 16, 16]         331,776
     BatchNorm2d-499          [-1, 192, 16, 16]             384
            ReLU-500          [-1, 192, 16, 16]               0
          Conv2d-501           [-1, 48, 16, 16]          82,944
     _DenseLayer-502           [-1, 48, 16, 16]               0
     BatchNorm2d-503         [-1, 1776, 16, 16]           3,552
            ReLU-504         [-1, 1776, 16, 16]               0
          Conv2d-505          [-1, 192, 16, 16]         340,992
     BatchNorm2d-506          [-1, 192, 16, 16]             384
            ReLU-507          [-1, 192, 16, 16]               0
          Conv2d-508           [-1, 48, 16, 16]          82,944
     _DenseLayer-509           [-1, 48, 16, 16]               0
     BatchNorm2d-510         [-1, 1824, 16, 16]           3,648
            ReLU-511         [-1, 1824, 16, 16]               0
          Conv2d-512          [-1, 192, 16, 16]         350,208
     BatchNorm2d-513          [-1, 192, 16, 16]             384
            ReLU-514          [-1, 192, 16, 16]               0
          Conv2d-515           [-1, 48, 16, 16]          82,944
     _DenseLayer-516           [-1, 48, 16, 16]               0
     BatchNorm2d-517         [-1, 1872, 16, 16]           3,744
            ReLU-518         [-1, 1872, 16, 16]               0
          Conv2d-519          [-1, 192, 16, 16]         359,424
     BatchNorm2d-520          [-1, 192, 16, 16]             384
            ReLU-521          [-1, 192, 16, 16]               0
          Conv2d-522           [-1, 48, 16, 16]          82,944
     _DenseLayer-523           [-1, 48, 16, 16]               0
     BatchNorm2d-524         [-1, 1920, 16, 16]           3,840
            ReLU-525         [-1, 1920, 16, 16]               0
          Conv2d-526          [-1, 192, 16, 16]         368,640
     BatchNorm2d-527          [-1, 192, 16, 16]             384
            ReLU-528          [-1, 192, 16, 16]               0
          Conv2d-529           [-1, 48, 16, 16]          82,944
     _DenseLayer-530           [-1, 48, 16, 16]               0
     BatchNorm2d-531         [-1, 1968, 16, 16]           3,936
            ReLU-532         [-1, 1968, 16, 16]               0
          Conv2d-533          [-1, 192, 16, 16]         377,856
     BatchNorm2d-534          [-1, 192, 16, 16]             384
            ReLU-535          [-1, 192, 16, 16]               0
          Conv2d-536           [-1, 48, 16, 16]          82,944
     _DenseLayer-537           [-1, 48, 16, 16]               0
     BatchNorm2d-538         [-1, 2016, 16, 16]           4,032
            ReLU-539         [-1, 2016, 16, 16]               0
          Conv2d-540          [-1, 192, 16, 16]         387,072
     BatchNorm2d-541          [-1, 192, 16, 16]             384
            ReLU-542          [-1, 192, 16, 16]               0
          Conv2d-543           [-1, 48, 16, 16]          82,944
     _DenseLayer-544           [-1, 48, 16, 16]               0
     BatchNorm2d-545         [-1, 2064, 16, 16]           4,128
            ReLU-546         [-1, 2064, 16, 16]               0
          Conv2d-547          [-1, 192, 16, 16]         396,288
     BatchNorm2d-548          [-1, 192, 16, 16]             384
            ReLU-549          [-1, 192, 16, 16]               0
          Conv2d-550           [-1, 48, 16, 16]          82,944
     _DenseLayer-551           [-1, 48, 16, 16]               0
     BatchNorm2d-552         [-1, 2112, 16, 16]           4,224
            ReLU-553         [-1, 2112, 16, 16]               0
          Conv2d-554          [-1, 192, 16, 16]         405,504
     BatchNorm2d-555          [-1, 192, 16, 16]             384
            ReLU-556          [-1, 192, 16, 16]               0
          Conv2d-557           [-1, 48, 16, 16]          82,944
     _DenseLayer-558           [-1, 48, 16, 16]               0
     BatchNorm2d-559         [-1, 2160, 16, 16]           4,320
            ReLU-560         [-1, 2160, 16, 16]               0
          Conv2d-561          [-1, 192, 16, 16]         414,720
     BatchNorm2d-562          [-1, 192, 16, 16]             384
            ReLU-563          [-1, 192, 16, 16]               0
          Conv2d-564           [-1, 48, 16, 16]          82,944
     _DenseLayer-565           [-1, 48, 16, 16]               0
     _DenseBlock-566         [-1, 2208, 16, 16]               0
     BatchNorm2d-567         [-1, 2208, 16, 16]           4,416
    _Interpolate-568         [-1, 2208, 32, 32]               0
          Conv2d-569         [-1, 2208, 32, 32]       4,665,504
          Conv2d-570          [-1, 768, 32, 32]      15,262,464
     BatchNorm2d-571          [-1, 768, 32, 32]           1,536
            ReLU-572          [-1, 768, 32, 32]               0
             _Up-573          [-1, 768, 32, 32]               0
    _Interpolate-574          [-1, 768, 64, 64]               0
          Conv2d-575          [-1, 768, 64, 64]         590,592
          Conv2d-576          [-1, 384, 64, 64]       2,654,592
     BatchNorm2d-577          [-1, 384, 64, 64]             768
            ReLU-578          [-1, 384, 64, 64]               0
             _Up-579          [-1, 384, 64, 64]               0
    _Interpolate-580        [-1, 384, 128, 128]               0
          Conv2d-581        [-1, 384, 128, 128]         147,840
          Conv2d-582         [-1, 96, 128, 128]         331,872
     BatchNorm2d-583         [-1, 96, 128, 128]             192
            ReLU-584         [-1, 96, 128, 128]               0
             _Up-585         [-1, 96, 128, 128]               0
    _Interpolate-586         [-1, 96, 256, 256]               0
          Conv2d-587         [-1, 96, 256, 256]           9,312
          Conv2d-588         [-1, 96, 256, 256]          83,040
     BatchNorm2d-589         [-1, 96, 256, 256]             192
            ReLU-590         [-1, 96, 256, 256]               0
             _Up-591         [-1, 96, 256, 256]               0
    _Interpolate-592         [-1, 96, 512, 512]               0
     BatchNorm2d-593         [-1, 96, 512, 512]             192
            ReLU-594         [-1, 96, 512, 512]               0
          Conv2d-595         [-1, 64, 512, 512]          55,360
          Conv2d-596          [-1, 3, 512, 512]             195
          Conv2d-597            [-1, 3, 32, 32]           2,307
          Conv2d-598            [-1, 3, 64, 64]           1,155
          Conv2d-599          [-1, 3, 128, 128]             291
          Conv2d-600          [-1, 3, 256, 256]             291
================================================================
Total params: 50,279,695
Trainable params: 50,279,695
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 3.00
Forward/backward pass size (MB): 4265.68
Params size (MB): 191.80
Estimated Total Size (MB): 4460.48
----------------------------------------------------------------
